app/controllers/notes_controller.rb

  def index
    @notes = Note.all
---
SELECT * FROM "notes"

  def category
    #Find the category object from its name
	puts params[:id]
	@category = Category.find_by_name(params[:id])
---
SELECT * FROM "categories" WHERE ("categories"."name" = 'JBS-homework') LIMIT 1

  def show
    @note = Note.find(params[:id])
---
SELECT * FROM "notes" WHERE ("notes"."id" = 1)

  def edit
    @note = Note.find(params[:id])
---
SELECT * FROM "notes" WHERE ("notes"."id" = 1)

  def create
    @note = Note.new(params[:note])

    respond_to do |format|
      if @note.save
---
INSERT INTO "notes" ("updated_at", "title", "description", "category_id", "created_at") VALUES('2010-06-15 02:14:19', 'Scrum', 'Read ch 1, 2 of agile with scrum ', 2, '2010-06-15 02:14:19')

  def update
    @note = Note.find(params[:id])
---
SELECT * FROM "notes" WHERE ("notes"."id" = 2)

  def destroy
    @note = Note.find(params[:id])
    @note.destroy
---
SELECT * FROM "notes" WHERE ("notes"."id" = 1)
DELETE FROM "notes" WHERE "id" = 1